// pages/directory/directory.js
Page({
  data: {
    num: ['一','二','三','四','五','六','七','八','九','十','十一','十二','十三',],
    titleNum: [
      '人生漫漫，何不从容过一生',
      '世间难得两全法',
      '那个离天堂最近的地方',
      '遇见仓央',
      '情愫',
      '人生是为何',
      '人生漫漫，何不从容过一生',
      '人生漫漫，何不从容过一生',
      '人生漫漫，何不从容过一生',
      '人生漫漫，何不从容过一生',
      '人生漫漫，何不从容过一生',
      '人生漫漫，何不从容过一生',
      '人生漫漫，何不从容过一生',
    ],
    content:[
      '渡劫这个词，我从没想过会在我的生命里出现。而我渡的不是别的，是情。我，张倩倩，过了年就步入30岁大营了。也就是别人眼中的剩女，95后口中的徐娘半老。女人这年龄,26，27的时候,你还觉得自己是个能风靡一条街的小姑娘，到了30，某天清晨，当你在镜子前发现眼角的细纹时，你会大呼，大事不好。就在前年,我认识了我现在的男朋友,经家人搭线相亲认识。要说有什么特殊感情嘛，我也估摸了许久,着实没摸明白。不过在朋友和家人的口中，我些许找到了点我们俩的共同之处:门当户对，都是名校的硕士高材生,走在一起倒也能引起路人的频频回头，更重要的是,我们都到了适婚年龄。要说和这样的优质股不结婚,我都想扇我自己一巴掌。就这样,我们俩不痛不痒的谈了一年半的恋爱。家人开始催我们的婚事,朋友们也无事爱询问一下。我俩呢,既不拒绝,但也没人提结婚这事。我估摸着他心中的那个白月光应该也不是我。有时我就想,未来我要是生女儿，一定不把她朝乖乖女路线培养。上学期间,想恋爱就恋爱，别一门心思都放在学习上，对于恋爱的观念还被老一辈的思想残害着:不以结婚为目的的恋爱都是耍流氓。我觉得我就是深受其害的一类姑娘。我父母，半个文化人吧，思想传统,从小女德思想就被他们根深蒂固的灌输着,当然这里的女德不是男尊女卑的那种,而是说，女生要本分,一定要好好学习,不能过早的踏入会、我妲经堂以那此比在中学时期就衣学时期就谈心岌的女生为反面例子给我教导:“看,那些女生都不正经,估计平时父母都不管，以后肯定会走上歪路的。,)所以，从中学到大学，即便有男生追求,我也以横眉冷对的高冷形象待之，因为我怕自己走上我妈所说的邪路。一晃眼,就研究生毕业了。眼看老大不小的姑娘连男生手都没拉过,我妈这才开始慌了，逢人就张罗着给我相亲的事。其实最开始我挺排斥相亲这事的，就好像一件本身很不错的商品却滞销了，不得不促销叫卖。可恋爱这能力吧,就和其他技能一样,要培养。20多年来我都不具备这种能力，根本不知道如何和一个男生展开一段恋情。所以，我痛下思定,觉得非常有必要去相亲了，不然我更不具备这种能力了。在相亲路上练就了一番眼力劲后,我总结了如下几点:但凡能来相亲的男女，—定在婚恋市场上是存在一定问题的。要不就是自身条件不是太好，形象上,职业上，学历上等等。要不就是像我这种,虽然看起来条件不错，但是不具备勾搭异性的能力，也就是说摸不清异性喜好的心理战术。还有一类人，条件倒不差,情商也不算低,但就是眼睛长在头顶上,自身70分,但一心想找到100分的人,久而久之就把自己耽误了。所以为了不让自己不沦入到第三类人中,我告知自己，一定要清楚自身的定位,找个和自己得分一致的就行。这么多年的书也不是白读的,分析问题的能力还是有的。于是乎,在工作了两年,相亲了N次后，我终于迎来了自己现任男友X先生。刚开始见面的时候,对X先生的感觉就是谈不上喜欢,也绝不讨厌。第一反应就是，呵,终于有个各方面条件和我都挺匹配的了。',
      '我相信X先生应该也是因为这个原因选择和我在虽然他总是含糊其辞地找任一配的。具F心说因为喜欢才选择在一起，但我相信女人的直觉一向是准的。一周一次的见面,10点前就必定结束,而且我们两公司的距离并不远，开车不到半小时路程。相处了一年多，礼物也没收到过几回。相比于闺蜜莎莎的恋爱,我的真的可以用了无生趣来形容了。所以每次在莎莎眼里泛着光聊起她和她男友的事件后,我就更觉得落寞。我不知道是我们不合适,还是爱情就是如此，只不过每对情侣的相处模式不一样罢了。所以在这样的自我质疑中,我和X先生居然相安无事的处了这么久。新年如期而至，儿时的爆火声声,张灯结彩,这些年也显得不那么热闹了。感觉过年更像是走个形式,除了三十，初一初二还略显年气外，从大年初三开始,就只剩下放假的快乐了。不出意料,饭桌上,家人又开始叽喳起了我的婚事。“倩倩呀,年后就30了吧!婚事准备的怎么样了?你俩都谈了快两年了，也该结婚了。”舅妈第一个发问。“就是的,女孩的年龄不敢拖,过了30连生孩子都要大龄了。”小姑也不甘示弱。“年后应该就要准备了，孩子的事,我们做大人的也操不来心。”说完,老妈白嫖了我一眼。我知道她心里也不是滋味，毕竟男方不提亲,女方家也不好说什么。从爷爷家出来后，我被老妈一把揪住,“你俩现在啥情况?他到底想不想结婚?他家里咋想的?你要问清楚呀，咱这年龄耽误不起了”“好的,好的,我知道了。”我不厌其烦地回道。里出有块石头堵着,-其买我心里也有块石头堵看,一方面男方的不提亲让我心生凉意,但另一方面又在想，如果X先生真的提亲的话，我就这样嫁了?想着想着，内心又深陷到不甘的沼泽中去了。总之，我知道，今年这年,过的不省心呐。初七,X先生提着年礼来了我家。我爸妈好酒好菜的张罗了一番。饭桌上我妈先发制人，“小X呀,你俩年龄都不小了,这婚事,不知道你爸妈有提吗?”这一问，我差点没把刚吃到嘴里的鱼,外加鱼刺卡到嗓子眼。真是怕啥来啥。X先生也面露难色,说:“我父母提了，应该今年吧,今年。我主要今年工作也比较忙，几个项目忙不过来,所以这事我也一直没准备起来。“工作再忙，也不能把婚姻大事耽误了呀。你男生无所谓,女孩子的年龄可耽误不得的。”我听出了母亲不满的语气。“对对，阿姨说的对，是我没准备周全,不好意思。”此时,感觉X先生再也不好意思提起筷子夹菜了。就这样在十分尴尬的气氛中，这个期许中的未来女婿算是登门拜了年。晚上躺在床上,我思前想后，其实我也不怪X先生,作为读了十几年书的文化人,还是挺会推己及人的。我相信X先生应该和我一样都抱着对方是鸡肋的态度在坚持着这份感情,弃之可惜,食之无味。既然自己都能想明白的情感,为何不能理解X先生的难处。年就这样一眨眼的功夫过完了。整个假期,我和X先生就见了一面,就在初七那天。每晚我们都是象征性的在微信上道声晚安，就算维系了这一天的关系，证明我们还是情侣。毕业后，我以优异的成绩进入了华企止,中国500强的科技公司。X先生也在相关领域工作，只不过单位不一样。',
      '每天的工作除了忙碌,还是忙碌。好在我是女生,也没有什么竞聘的意向，就这么混着,拿着邻居家姑娘羡慕的年薪。我们这行对女生来说,有点吃青春饭。因为太忙碌,很多结了婚,有了孩子的女性,但凡老公再能挣点,多数都辞职回归家庭了。看着之前离职的姐姐们微信朋友圈发的庭前花开,闲情逸致的生活,我就只恨自己为啥还是个悲催的打工魂。可能是工作的压力,外加感情的不顺,我觉得就差最后一根稻草压垮我的理智了。有一天，我觉得我必须要来一场说走就走的旅行，去远方，去寻找我的诗,我灵魂可以驻足的地方。还想稍微摆脱一下我妈，这个掌控我生活和精神世界快30年的人。我想去西藏,他们都说那是离天堂最近的地方。我觉得我现在的生活太需要天堂的净化了，管他什么高反不高反,这年龄我再不疯狂一把，就太对不起自己了。说不定，回来后，我就嫁个了X先生，然后生个一儿一女，就这样一辈子在这骨感的现实中到老，到死。我请了年假,在和母亲据理力争后,她以一副要和我断绝母女关系的态度同意了我去西藏。以她的原话就是,太危险了,要X先生陪我去。我怕一句:X先生肯定不会陪我去，噎着她，所以也没说出口。这些年我和X先生就没旅游过,更别提我提出要他陪我旅游了。忙永远是男人最好的借口。你生气吧，显得你不懂事，不理解他。你不生气呢,谁知道人家是忙,还是就不想陪你。与其成为怨妇，不如自己成为自己的主，独立女性不都是要活得洒脱嘛。我约了高中好友雷蕾子，这姑娘和她的名字—样,不走寻常路。二十岁开始就进藏。能在身上没银两的情况下愣是在云南生存了半年,据她说，就是每天给民宿老板娘打工，老板娘管吃住,然后她再自行在大街上卖串好的珠子,挣点小零花。雷蕾子自小父母离异,跟着爷爷奶奶生活，也无形中培养了她独特的三观和独立的生存能力。有的时候,我挺羡慕她，觉得人家才是真真的活着，我这家养的金丝雀始终向往真正的自由。就这样，我们在开春后上路了。',
      '伏案在桌前,昏暗的灯光在黑夜里如此刺眼。我来到了阳台,想起来也真是可笑，我将被自己买的房子亲手送葬,我曾无数次想从这一跃而下,这次可能是最后一次了。我从小就认为人的生存一定是有目的的，如果没有，那和死了有什么区别，上学的时候有上学的任务，而我现在只不过是老板手中的一枚棋子。别人都不是真的，他们只是我心中的记忆,这个世界只有我自己。想到这,我从裤口袋里掏出半根烟,边抽边笑，,为什么这世界史只有我一个人?为什么只有我一个人,我还不可以达到理想?望着窗外的都市灯光，那仿佛并不属于我,只有阳台对面候着我的死神才是我的知音。我从小妈就不让我和别人家的孩子玩,我好像也并没有反抗什么,反正和我记忆中的人应该也没什么好玩的，当我上初中的时候,经常别人嘲笑当做异想天开的败类。这和我理想的不一样啊!我再次来到桌前,抽出一张白纸，在上面写上“遗书”二字,要问为什么?没有为能已经活不下去了什么，找见得找口能t卜云了,人们常说要敢想,但是在长大的过程中我发现好像并不是这样的,事情总是不经人事,我的理想被一再刺痛。整理好遗书和遗物后，我爬上阳台的窗户上，这刺骨的风好像第一次是我感到神清气爽,起码，它是真实的,接着我就朝后睡去了。当我再次醒来的时候我已经在医院了,我似乎并不吃惊,接着一名警察说因为一个水果棚我得以幸存。说实话,我恨死那个水果棚了。这是我25岁的事情这是我去酒馆听一个老无赖说的，我后来听朋友说他原来是一个很有名的程序员,就在一次跳楼之后，就没有公司再敢用他了。看着眼前喝着酒的男人,这不得不让我想到人生是为何?',
    ]
  },
  onLoad: function (options) {

  },
  //选择章节跳回阅读
  backRead(event){
    console.log(event)
    var pages = getCurrentPages();
    console.log(pages)//可以看到里面一个数组
    var currPage = pages[pages.length - 1];  //当前页面
    var prevPage = pages[pages.length - 2];  //上一个页面
    prevPage.setData({//设置上个页面中message属性值，
      chapter: this.data.num[event.target.id],
      chapterTitle: this.data.titleNum[event.target.id],
      content: this.data.content[event.target.id]
    })
    wx.navigateBack({
      delta: 1
    }) 
  }
})